Public Attributes | List of all members
API_Box3D Struct Reference
Element Manager API
Rectangular region of the model with Z extent. More...
#include <APIdefs_Base.h>
 Public Attributes
double  | xMin
double  | yMin
double  | zMin
double  | xMax
double  | yMax
double  | zMax
Detailed Description
Rectangular region of the model with Z extent.
Remarks
It is a rectangle in model coordinates, with vertical information. Always expressed in meters, if no other instructions in the corresponding documentation.
Member Data Documentation
◆ xMax
 double API_Box3D::xMax
◆ xMin
 double API_Box3D::xMin
◆ yMax
 double API_Box3D::yMax
◆ yMin
 double API_Box3D::yMin
◆ zMax
 double API_Box3D::zMax
◆ zMin
 double API_Box3D::zMin